/**
 * Copyright (c) 2016, Gluon Software
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
 * following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation and/or other materials provided
 *    with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse
 *    or promote products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
[{"uuid":"5080","name":"Hazelcast","summary":"Hazelcast offers a leading open source in-memory data grid that is also the fastest, according to benchmarks. Any application, any cloud can be made real-time with the Hazelcast in-memory computing platform. A wide of array of cloud deployment options and programming language interfaces is supported.","picture":"","url":"www.hazelcast.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5001"},{"uuid":"5679","name":"Vaadin","summary":"Vaadin provides developer tools, components, and services for building modern web applications. Write once in Java or JavaScript and use on all devices. Its products are used by 150,000 developers worldwide and 40 percent of the Fortune 100.","picture":"","url":"vaadin.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5401"},{"uuid":"4897","name":"Couchbase","summary":"Couchbase delivers the database for the digital economy. Developers around the world choose Couchbase for its advantages in data model flexibility, performance, and 24/365 availability to build enterprise web, mobile, and IoT applications.The Couchbase platform includes Couchbase, Couchbase Lite (the first mobile NoSQL database), and Sync Gateway. All Couchbase products are open source projects. Couchbase customers include industry leaders such as AT&T, Cisco, Comcast, Disney, Dixons, eBay, General Electric, Marriott, Nordstrom, and Wells Fargo, plus hundreds of other household names.","picture":"https://published-rs.lanyonevents.com/published/oracleus2016/files/7614/16_Couchbase_600x200_clr.png","url":"www.couchbase.com/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5002"},{"uuid":"5568","name":"Sonatype Nexus","summary":"","picture":"","url":"www.sonatype.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5611"},{"uuid":"5707","name":"VSP","summary":"See what’s possible! VSP Global is a group of progressive companies that offers innovative and personalized eye care, optical, and business solutions to help people see.","picture":"","url":"www.vspglobal.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5009"},{"uuid":"6270","name":"AOL","summary":"AOL is focused on delivering mobile-centric, data-enhanced, video-rich experiences across an open ecosystem and a global marketplace. Our continued growth and evolution are products of nearly a decade of careful cultivation of our internal strengths, coupled with thoughtful acquisitions and rigorous integration of the very best technologies and talents on the market.\nWith global award-winning consumer brands (HuffPost, TechCrunch, engadget) and the industry’s most innovative advertising and monetization solutions, we build powerful connections between consumers and creators.","picture":"https://published-rs.lanyonevents.com/published/oracleus2016/files/7966/16_AOL_600x200_blk.png","url":"engineering.aol.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"6016"},{"uuid":"5301","name":"New Relic","summary":"New Relic is a software analytics company that makes sense of billions of metrics about millions of applications in real time. Our comprehensive SaaS-based solution provides one powerful interface for web and native mobile applications and consolidates the performance monitoring data for any chosen technology in your environment.","picture":"https://published-rs.lanyonevents.com/published/oracleus2016/files/7901/16_New%2520Relic_600x200_clr.png","url":"www.newrelic.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5511"},{"uuid":"5218","name":"Liferay, Inc.","summary":"Liferay makes software that helps organizations create digital experiences on web, mobile, and connected devices. Its platform is open source: more reliable, innovative, and secure. Customers include Adidas, Carrefour, Cisco Systems, Danone, Fujitsu, Lufthansa Flight Training, Siemens, Société Générale, and the United Nations.","picture":"","url":"www.liferay.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5107"},{"uuid":"4719","name":"Aerion Technologies","summary":"","picture":"","url":"","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5612"},{"uuid":"4965","name":"Eclipse Foundation","summary":"Eclipse is a community for individuals and organizations wanting to collaborate on commercially friendly open source software. Its projects are focused on building an open development platform comprising extensible frameworks, tools, and runtimes for building, deploying, and managing software across the lifecycle.","picture":"","url":"www.eclipse.org/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5017"},{"uuid":"5841","name":"Takipi","summary":"","picture":"","url":"","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5615"},{"uuid":"6342","name":"Broadleaf Commerce","summary":"Broadleaf Commerce gives companies the agility to lead in an evolving ecommerce market. Java-based, disruptively priced, and designed for endless customization and integration, Broadleaf powers enterprise ecommerce platform solutions for premier brands, including The Container Store, O’Reilly Auto Parts, and Vology.","picture":"","url":"www.broadleafcommerce.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5012"},{"uuid":"5494","name":"Riverbed Technology","summary":"Riverbed is a leader in application performance infrastructure, delivering the most complete platform for the hybrid enterprise to ensure that applications perform as expected, data is always available when needed, and performance issues can be proactively detected and resolved before degrading business performance.","picture":"","url":"www.riverbed.com/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5600"},{"uuid":"6103","name":"Cask","summary":"Cask provides an open source big data application and integration platform enabling Java developers and data scientists to decrease the time to build, deploy, and operate data-centric applications and data lakes. It also helps IT organizations implement environments designed to quickly unlock data value.","picture":"","url":"cask.co/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5010"},{"uuid":"5862","name":"Auth0","summary":"Auth0 is an enterprise-grade platform for modern identity. We give you tools that eliminate the friction of authentication for your applications and APIs—all accessible through your account dashboard.","picture":"","url":"www.auth0.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5712"},{"uuid":"5710","name":"Waratek","summary":"Waratek protects applications from logic, network, and vulnerability exploits without code changes, agents, or hardware devices. A pioneer in runtime application self-protection, Waratek monitors, detects, and blocks threats in the Java runtime environment, without any user-discernible performance degradation.","picture":"","url":"www.waratek.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5700"},{"uuid":"5171","name":"JFrog","summary":"Millions of developers globally rely on JFrog’s world-class infrastructure for software management and distribution. JFrog tools, including open source, on-premises, and SaaS cloud solutions, are revolutionizing the way companies and individuals develop, release, and distribute software.","picture":"","url":"www.jfrog.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5206"},{"uuid":"6269","name":"Split Software","summary":"Split builds on feature flags to create platforms for controlled release, so any team can target customers and roll out or revert new features without a deployment—or touching code.","picture":"","url":"www.split.io","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5606"},{"uuid":"6341","name":"Chetu Inc","summary":"","picture":"","url":"","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5014"},{"uuid":"5699","name":"Visual Studio Partner","summary":"","picture":"","url":"","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5706"},{"uuid":"6061","name":"Lightbend Inc.","summary":"Lightbend is the proud provider of a world-leading reactive application development platform. We are a passionate crew of technology pioneers committed to building amazing software. We build and maintain the Akka message-driven runtime, Play web framework, Lagom Microservices framework, and Scala programming language, and we contribute to Apache Spark. Our mission is to help developers build high-performance applications that are message-driven, elastic, resilient, and responsive.","picture":"https://published-rs.lanyonevents.com/published/oracleus2016/files/7900/16_Lightbend_600x200_clr.png","url":"www.lightbend.com/","location":"","booth":""},{"uuid":"4923","name":"Datalogics, Inc.","summary":"Datalogics, a premier source for Adobe PDF technologies, has dedicated more than 45 years to delivering the highest-quality software technologies, including the PDF Java Toolkit (PDFJT), a native Java library that provides high-level APIs for automating PDF workflows.","picture":"","url":"www.datalogics.com/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"6007"},{"uuid":"4910","name":"CUBA Platform","summary":"CUBA Platform is a high-level open source Java framework for the rapid development of enterprise applications. Scalable full stack architecture, built-in components, WYSIWYG design, code generation, hot deploy, and support for popular Java IDEs bring unprecedented developer productivity.","picture":"","url":"www.cuba-platform.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5015"},{"uuid":"5174","name":"Jinfonet Software","summary":"Jinfonet empowers companies to embed the most-sophisticated reports and dashboards into web applications. Through the JReport analytics platform, developers and users gain advanced visualization capabilities with any datasource. Every day, JReport delivers insights for hundreds of thousands of users at more than 10,000 installations worldwide.","picture":"","url":"www.jinfonet.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5113"},{"uuid":"5387","name":"Payara","summary":"Payara Server is a drop-in replacement for GlassFish Server Open Source Edition. Quarterly releases contain enhancements, bug fixes, and patches. It is optimizedto be the best application server for production Java EE applications, with 24/7 dedicated incident/software support from the industry’s best middleware engineers.","picture":"","url":"www.payara.fish","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5716"},{"uuid":"5158","name":"iText Software Group","summary":"A member of the ISO Committee and PDF Association, iText Software is a world-leading company in PDF technology. Founded in 2000, the company offers the world’s largest open source PDF library for developers and a successful software business for its commercial customers.","picture":"","url":"www.itextpdf.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5000"},{"uuid":"4899","name":"Crafter Software","summary":"Crafter Software enables the creation of rich and engaging websites, mobile applications, and multichannel digital experiences. Our solutions are based on the award-winning Crafter CMS open source project, a modern platform for creating unique web experiences faster through targeted delivery of personalized content.","picture":"","url":"www.craftersoftware.com/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5102"},{"uuid":"4791","name":"Azul Systems","summary":"Azul Systems, the industry’s only company exclusively focused on Java and the Java Virtual Machine, builds fully supported, certified standards-compliant Java runtime solutions that bring the power of Java to the enterprise, the embedded community, and the IoT.","picture":"","url":"www.azul.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5607"},{"uuid":"5381","name":"Palamida, Inc.","summary":"Palamida delivers products and services for software composition analysis. We help customers identify and track open source and other externally written software in their development projects to manage and secure the software they write against risks resulting from intellectual property infringement and security vulnerabilities.","picture":"","url":"www.palamida.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5702"},{"uuid":"6042","name":"OWASP Foundation","summary":"The Open Web Application Security Project (OWASP), a 501(c)(3) global not-for-profit charitable organization, aims to improve software security. Our mission is to make software security visible so individuals and organizations can make informed decisions. Operating as a community of like-minded professionals, OWASP issues software tools and knowledge-based documentation on application security. Anyone can participate in OWASP, and all materials are available under a free, open software license.","picture":"","url":"www.owasp.org","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"6006"},{"uuid":"6343","name":"FreeWave Technologies","summary":"","picture":"","url":"","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5212"},{"uuid":"6332","name":"Treehouse Island","summary":"Treehouse learning tracks provide independent learning paths that will fit your needs across a variety of teams. Keeping your staff up to date with knowledge provides fuel for managers, developers, and operational teams powering your organization.","picture":"","url":"teamtreehouse.com/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5016"},{"uuid":"5925","name":"Neeve Research, LLC.","summary":"Neeve Research was founded on the belief that memory-oriented computing is a revolution that will fundamentally change enterprise computing. Neeve specializes in memory-oriented transaction processing. Its flagship product, the X Platform, is a next-generation application platform enabling rapid development of transaction processing applications.","picture":"","url":"www.neeveresearch.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5006"},{"uuid":"5169","name":"Jelastic","summary":"Jelastic is a DevOps PaaS for business, deployable on bare-metal hardware or IaaS. It provides certified containers for Java, PHP, Ruby, and more and the ability to use custom Docker containers. Jelastic offers agile deployment models to proprietary APIs, flexible automatic scaling, and more.","picture":"","url":"jelastic.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5013"},{"uuid":"5410","name":"Pivotal","summary":"Pivotal transforms how the world builds software. Pivotal combines the Silicon Valley state of mind, modern approach, and infrastructure with organizations’ core expertise and values. We enable the leading companies in the world to innovate by employing an approach focused on building—not buying—software.","picture":"","url":"pivotal.io","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5101"},{"uuid":"5657","name":"Tomitribe","summary":"Tomitribe is an innovative engine driving open source and Java EE technologies together through community and enterprise global support for Apache Tomcat and TomEE. We help customers evolve their IT strategies and leverage the scalability of microservice architecture.","picture":"","url":"www.tomitribe.com/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5007"},{"uuid":"5065","name":"Goldman Sachs","summary":"The Goldman Sachs Group, Inc., is a leading global investment banking, securities, and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments, and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world.","picture":"","url":"www.goldmansachs.com/what-we-do/engineering/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"6004"},{"uuid":"5586","name":"Stormpath","summary":"Stormpath is a complete and easy identity management API for developers building web, mobile, or API-driven applications. Prebuilt user management enables teams to launch applications faster.","picture":"","url":"stormpath.com/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"6009"},{"uuid":"4959","name":"Dynatrace","summary":"Dynatrace is the innovator behind the industry’s premier digital performance platform, making real-time information about digital performance visible and actionable across business and IT. We help customers see their applications and digital channels through the lens of their end users.","picture":"","url":"www.dynatrace.com/en/application-monitoring/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5115"},{"uuid":"5749","name":"IBM","summary":"For 20+ years, IBM has been one of the largest investors in and contributors to the Java platform and an active member of the developer community. IBM offers a comprehensive portfolio of solutions, services, and systems for Java developers supporting mobile, web, cognitive, analytics, and IoT. IBM’s Bluemix offers Java developers a robust cloud-development platform to speed app development, including access to enterprise services and APIs and scalable hosting in hybrid, public, dedicated, and/or on-premises environments.","picture":"https://published-rs.lanyonevents.com/published/oracleus2016/files/7899/15_IBM_600x200_clr.png","url":"ibm.com/oracle","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5201"},{"uuid":"6347","name":"Sysdig","summary":"Sysdig. The only monitoring and troubleshooting tool purpose-built for containers. Need to know what your containers are doing? Sysdig is the most powerful container-native monitoring and troubleshooting solution. Built on ContainerVision, Sysdig can see inside your containers without intrusive instrumentation. We natively integrate with the entire container ecosystem, providing deep visibility into applications and microservices. Get a free trial at www.sysdig.com","picture":"","url":"www.sysdig.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"6005"},{"uuid":"5448","name":"Qoppa Software","summary":"Qoppa Software produces PDF software. Our suite of products includes desktop and server applications, plus developer tools in Java and Android. We support all major platforms: Windows, UNIX/Linux, Mac OS, Android. Our products are designed and developed to provide the highest-level performance and reliability.","picture":"","url":"www.qoppa.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5114"},{"uuid":"4951","name":"DocuSign","summary":"DocuSign is a secure, globally trusted esignatures platform; the DocuSign API provides flexibility and control to scale from simple, fast esignature integrations to full-featured enterprise applications. See how our new APIs and open source Java SDK make streamlining approvals, contracts, and complex workflows a snap.","picture":"","url":"www.docusign.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5601"},{"uuid":"4875","name":"CloudBees","summary":"CloudBees, the Enterprise Jenkins Company, is a continuous delivery (CD) leader. Building on the strength of Jenkins, the world’s most popular open source continuous delivery hub and ecosystem, the CloudBees Jenkins Platform provides CD solutions that meet the unique security, scalability, and manageability needs of enterprises.","picture":"","url":"www.cloudbees.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5110"},{"uuid":"5328","name":"O'Reilly Media, Inc.","summary":"O’Reilly Media is a multifaceted media company that has played a seminal role in the internet revolution. Through books, events, online training courses, webcasts, and evangelism, O’Reilly has educated a generation of technologists and entrepreneurs and shaped the dialogue about the industry’s future direction.","picture":"","url":"www.oreilly.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5004"},{"uuid":"5742","name":"ZeroTurnaround, Inc.","summary":"ZeroTurnaround is transforming how software is created, enabling development teams to build better software faster.","picture":"","url":"zeroturnaround.com/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5214"},{"uuid":"5763","name":"Red Hat","summary":"Red Hat is a leading provider of open source software solutions. In collaboration with customers, partners, and communities, it creates reliable and high-performing cloud, Linux, middleware, mobile, management, storage, and virtualization technologies and offers award-winning support, training, and consulting services.","picture":"","url":"www.redhat.com/en","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5301"},{"uuid":"5588","name":"StrongAuth, Inc.","summary":"StrongAuth is an open source Silicon Valley company operating since 2001 and focused on cryptographic key management. It has customers on six continents in banking, healthcare, ecommerce, payments, manufacturing, biotechnology, and military. Strengths: ALESA website, Fast Identity Online (FIDO), secure cloud computing with RC3, data protection infrastructure.","picture":"","url":"www.strongauth.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5608"},{"uuid":"6244","name":"Consensus Corp","summary":"","picture":"","url":"","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"6001"},{"uuid":"5111","name":"IDR Solutions","summary":"IDRSolutions offers a innovative way to display your PDF files so you can access them on your mobile, tablet, and desktop by converting PDF to HTML5 and XFA/FDF forms to HTML5. It also offers a Java PDF library and an image library.","picture":"","url":"www.idrsolutions.com/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5710"},{"uuid":"5061","name":"GitHub, Inc.","summary":"","picture":"https://published-rs.lanyonevents.com/published/oracleus2016/files/7898/14_GitHub_600x200_clr.png","url":"","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5507"},{"uuid":"5597","name":"Synopsys","summary":"Through its Software Integrity Platform, Synopsys provides advanced solutions for improving the quality and security of software. This comprehensive platform of automated analysis and testing technologies enables organizations to detect and remediate quality defects, security vulnerabilities, and compliance issues early in the software development lifecycle.","picture":"","url":"www.synopsys.com/software/","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5610"},{"uuid":"4774","name":"Atlassian","summary":"Atlassian unleashes the potential in every team. Our products help teams collaborate, build software, and serve their customers better. Teams at more than 54,000 large and small organizations—including BMW, Citigroup, eBay, Coca-Cola, and NASA—use Atlassian’s tracking, collaboration, communication, service management, and development products to work smarter and deliver quality results on time. Learn about products including JIRA, Confluence, HipChat, and Bitbucket at http://atlassian.com.","picture":"https://published-rs.lanyonevents.com/published/oracleus2016/files/7896/15_Atlassian_600x200_clr.png","url":"www.atlassian.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5614"},{"uuid":"5067","name":"Gradle Inc.","summary":"Gradle Inc., a Silicon Valley startup, transforms how software is built and shipped. Gradle develops, distributes, and supports the Gradle open source project. It helps enterprises ship software faster and more continuously by unifying and automating build processes and provides training, consulting, and support.","picture":"","url":"www.gradle.org","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5515"},{"uuid":"5072","name":"GridGain Systems","summary":"GridGain provides an enterprise-grade in-memory computing platform built on Apache Ignite. GridGain solutions connect data stores (SQL, NoSQL, and Hadoop) with cloud-scale applications and enable massive data throughput and ultralow latencies across a scalable cluster of commodity servers. Visit gridgain.com.","picture":"","url":"www.gridgain.com","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5501"},{"uuid":"5170","name":"JetBrains","summary":"","picture":"","url":"","location":"Hilton San Francisco, Grand Ballroom, Java Hub","booth":"5106"}]