/**
 * Copyright (c) 2016, Gluon Software
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
 * following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation and/or other materials provided
 *    with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse
 *    or promote products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
[
  {"uuid":"1","name":"Hilton San Francisco Union Square","location":"333 O'Farrell Street\nSan Francisco, California 94102","latitude":37.785687,"longitude":-122.410380,"phoneNumber":"+14157711400", "url":"http://www3.hilton.com/en/hotels/california/hilton-san-francisco-union-square-SFOFHHH/index.html"},
  {"uuid":"2","name":"Parc 55 San Francisco","location":"55 Cyril Magnin Street\nSan Francisco, California 94102","latitude": 37.784959, "longitude" : -122.409026, "phoneNumber":"+14153928000", "url":"http://www3.hilton.com/en/hotels/california/parc-55-san-francisco-a-hilton-hotel-SFOSFHH/index.html"},
  {"uuid":"3","name":"Moscone West","location":"800 Howard Street\nAt the corner Fourth and Howard Streets\nSan Francisco, California 94103","latitude": 37.78320, "longitude" : -122.40345, "phoneNumber":"+14159744000", "url":"http://www.moscone.com/site/do/index"},
  {"uuid":"4","name":"Moscone Center","location":"747 Howard Street\nAt the corner Third and Howard Streets\nSan Francisco, California 94103","latitude": 37.783973, "longitude" : -122.401226, "phoneNumber":"+14159744000", "url":"http://www.moscone.com/site/do/index"}
]